Repository: TheHiddenHaku/GestPay
Catalog: languages/*/messages.po
Languages: it

source: The variable %s must be an array in %s:%s
it: La variabile %s deve essere un array in %s:%s

source: The PHP function %s failed
it: La funzione PHP %s è fallita

source: cURL error %d
it: Errore cURL %d

source: Generic cURL error
it: Errore cURL generico

source: HTTP error: %s
it: Errore HTTP: %s

source: Socket error %d
it: Errore socket: %d

source: Generic socket error
it: Errore socket generico

source: cURL and socket non available in PHP
it: cURL e socket non disponibili in PHP

source: Unknown error in response
it: Errore sconosciuto nella risposta

source: US dollar
it: Dollaro USA

source: GB pound
it: Sterlina inglese

source: Swiss franc
it: Franco svizzero

source: Danish krone
it: Corona danese

source: Norwegian krone
it: Corona norvegese

source: Swedish krona
it: Corona svedese

source: Canadian dollar
it: Dollaro canadese

source: Italian lira
it: Lira italiane

source: Japanese Yen
it: Yen giapponese

source: Hong Kong dollar
it: Dollaro di Hong Kong

source: Brazilian real
it: Real brasiliano

source: Transaction successful
it: Transazione correttamente effettuata

source: Invalid shop login
it: Login negozio non valido

source: Currency not valid
it: Valuta non valida

source: Amount not valid
it: Importo non valido

source: Shop transaction ID not valid
it: Identificativo tranzazione negozio non valido

source: Language not valid
it: Lingua non valida.

source: Empty response
it: Risposta vuota

source: String to decrypt not valid
it: Stringa da decriptare non valida

source: Payment page loaded successfully
it: Pagina di pagamento caricata correttamente

source: Card is locked
it: Carta bloccata

source: Confirmed amount exceeding the authorized amount
it: Importo conferma superiore ad importo autorizzato

source: Request to transfer a non-existent authorization
it: Richiesta di movimentare una autorizzazione inesistente

source: Pre-authorization expired
it: Preautorizzazione scaduta

source: Invalid currency
it: Divisa non corretta

source: Pre-authorization already notified
it: Preautorizzazione già notificata

source: Authorization denied
it: Autorizzazione negata

source: Transaction aborted by the bank authorization system
it: Transazione interrotta dal sistema autorizzativo della banca

source: Vendor configuration error in bank authorization system
it: Configurazione esercente errata in sistema autorizzativo banca

source: Wrong card date
it: Data carta errata

source: Bank authorization system not available
it: Sistema autorizzativo banca non disponibile

source: Insufficient card cash
it: Disponibilità carta non sufficiente

source: Please call company
it: Chiamare Ente

source: Technical error
it: Errore tecnico

source: Seize card
it: Ritirare carta

source: Authorization denied from the circuits
it: Autorizzazione negata dai circuiti

source: Unrecognized card
it: Carta non riconosciuta

source: Technical error while communicating with the international circuits
it: Errore tecnico nel colloquio con i circuiti internazionali

source: Wrong pin
it: Pin errato

source: Unavailable network
it: Rete non disponibile

source: Wrong transaction date
it: Data transazione errata

source: Expired card
it: Carta scaduta

source: Card not enabled
it: Carta non abilitata

source: Operation not allowed
it: Operazione non permessa

source: Operation not allowed (exceeded pin attempts)
it: Operazione non permessa (Tentativi pin esauriti)

source: Amount not available
it: Importo non disponibile

source: Operation not accomplished
it: Operazione non effettuata

source: Operation abandoned by buyer
it: Operazione abbandonata dal compratore

source: Bank transfer not authorized
it: Bonifico non autorizzato

source: Wrong credit card check digit
it: Carta di credito con Check-digit errato

source: Empty parameters string
it: Stringa di parametri vuota

source: Invalid parameter string
it: Formato non valido della stringa di parametri

source: = symbol not preceded by a parameter name
it: Simbolo = non preceduto da nome parametro

source: Parameter string ends with a separator
it: La stringa di parametri termina con un separatore

source: Invalid parameter name
it: Nome parametro non valido

source: Invalid parameter value
it: Valore parametro non valido

source: Duplicated parameter name
it: Nome parametro ripetuto

source: Unexpected parameter name. Please check the fields and parameters configuration in Back Office.
it: Nome parametro non previsto. Verificare la configurazione Campi e Parametri nel Back Office.

source: Empty mandatory parameter
it: Parametro obbligatorio non valorizzato

source: Missing parameter
it: Parametro mancante

source: Missing PAY1_UICCODE parameter
it: Parametro PAY1_UICCODE non presente

source: Invalid currency code
it: Codice divisa non valido

source: Missing PAY1_AMOUNT parameter
it: Parametro PAY1_AMOUNT non presente

source: Amount not numeric
it: Importo non numerico

source: Wrong number of decimals in amount
it: Importo con numero di decimali errato

source: Missing PAY1_SHOPTRANSACTIONID parameter
it: Parametro PAY1_SHOPTRANSACTIONID non presente

source: PAY1_SHOPTRANSACTIONID parameter too long
it: Parametro PAY1_SHOPTRANSACTIONID troppo lungo

source: Invalid language identifier
it: Identificativo lingua non valido

source: Non-numeric characters in the credit card number
it: Il numero di carta contiene caratteri non numerici

source: Wrong length of the credit card number
it: Lunghezza errata del numero di carta di credito

source: Credit card of a disabled company
it: Carta di credito di una compagnia non abilitata

source: Expiration year without month
it: Anno di scadenza senza mese di scadenza

source: Expiration month without year
it: Mese di scadenza senza anno di scadenza

source: Invalid expiration month
it: Mese di scadenza non valido

source: Invalid expiration year
it: Anno di scadenza non valido

source: Expiry date exceeded
it: Data scadenza superata

source: Invalid buyer email
it: Indirizzo email compratore non valido

source: Parameters string too long
it: Stringa di parametri troppo lunga

source: Parameter value too long
it: Il valore assegnato al parametro è troppo lungo

source: Call not accepted: missing A parameter
it: Chiamata non accettata: parametro A mancante

source: Call not accepted: shop not recognized
it: Chiamata non accettata: negozio non riconosciuto

source: Call not accepted: unactive shop
it: Chiamata non accettata: il negozio non è attivo

source: Call not accepted: missing B parameter
it: Chiamata non accettata, manca il parametro B

source: Call not accepted: empty B parameter
it: Chiamata non accettata: parametro B vuoto

source: Call not accepted: other parameters in addition to A and B
it: Chiamata non accettata: presenti altri parametri oltre ad A e B

source: Call not accepted: transaction not started by a call to the server-to-server cryprography system
it: Chiamata non accettata: la transazione non è iniziata con una chiamata al sistema di crittografia server-server

source: Call not accepted: transaction already processed previously
it: Chiamata non accettata: la transazione è già stata processata precedentemente

source: Call not accepted: missing credit card number or expiration
it: Chiamata non accettata: numero carta o scadenza carta mancanti

source: Call not accepted: the shop doesn’t have a public payment page
it: Chiamata non accettata: il negozio non ha una pagina di pagamento pubblica

source: Transaction abandoned by the customer
it: Transazione abbandonata dal cliente

source: Call not accepted: unacceptable parameters string
it: Chiamata non accettata: stringa di parametri non accettabile

source: Call not accepted: invalid IP address
it: Chiamata non accettata: indirizzo IP non valido

source: Transaction abandoned by the buyer
it: Transazione abbandonata dal compratore

source: Empty nandatory field
it: Campo obbligatorio non valorizzato

source: Invalid OTP
it: OTP invalida

source: Amount too low
it: Importo troppo basso

source: Amount too high
it: Importo troppo alto

source: Invalid buyer name
it: Nome del compratore non valido

source: Missing or wrong CVV2
it: CVV2 mancante o errato

source: IPIN must have a value
it: Valorizzare IPIN

source: Wrong parameters
it: Parametri errati

source: Unable to verify the card qualification for the VBV service
it: Impossibile verificare l’abilitazione della carta al servizio VBV

source: Call not accepted: missing TransKey
it: Chiamata non accettata: TransKey mancante

source: The ABI code does not match any of the banks in the BankPass circuit
it: Codice ABI non corrispondente ad alcuna banca aderente a BankPass

source: BankPass transaction abandoned by the buyer
it: Transazione BankPass abbandonata dal compratore

source: BankPass – Buyer authentication failed
it: BankPass - Fallita autenticazione compratore

source: BankPass – No available payment tool
it: BankPass – Nessuno strumento di pagamento disponibile

source: BankPass – Technical error
it: BankPass - Errore tecnico

source: BankPass Server-Server: return URL not specified
it: BankPass Server-Server: URL di ritorno non valorizzata

source: BankPass Server-Server: return URL too long (max 250 characters)
it: BankPass Server-Server: URL di ritorno troppo lunga (max 250 caratteri)

source: BankPass Server-Server: invalid return URL (must start with http:// or https://)
it: BankPass Server-Server: URL di ritorno non valida (deve iniziare con http:// o https://)

source: BankPass Server-Server: return URL parameter not found
it: BankPass Server-Server: Parametro URL Return non presente

source: BankPass Server-Server: IDBankPass not found
it: BankPass Server-Server: IDBankPass non presente

source: BankPass Server-Server: IDBankPass not valid
it: BankPass Server-Server: IDBankPass non valido

source: Transaction excedees the maximum number of operations in the time interval
it: La transazione eccede il numero massimo di operazioni nell’intervallo di tempo

source: Transaction excedees the maximum number of operations done by the user in the time interval
it: La transazione eccede il numero nassimo di operazioni effettuate dallo stesso utente nell’intervallo di tempo

source: Transaction excedees the maximum amount in the time interval
it: La transazione eccede l’importo massimo nell’intervallo di tempo

source: Transaction excedees the maximum amount for the same user in the time interval
it: La transazione eccede l’importo massimo pagabile dallo stesso utente nell’intervallo di tempo

source: Transaction contains an amount declared as not acceptable
it: La transazione contiene un valore dichiarato come non accettabile

source: Transaction abandoned because it’s a duplicated of a previous transaction
it: La transazione è stata abbandonata in quanto duplicato di una effettuata precedentemente

source: Wrong line length
it: Lunghezza linea errata

source: Invalid SHOPTRANSACTIONID field
it: Campo SHOPTRANSACTIONID non correttamente valorizzato

source: Invalid DIVISA field
it: Campo DIVISA non correttamente valorizzato

source: Invalid IMPORTO field
it: Campo IMPORTO non correttamente valorizzato

source: Empty DATA AUTORIZZAZIONE field
it: Campo DATA AUTORIZZAZIONE non correttamente valorizzato

source: Transaction does not exist
it: Transazione non esistente

source: Transaction is not unique
it: Transazione non univoca

source: More than one line for the same transaction in the file
it: Il file contiene più di una riga relativa alla stessa transazione

source: You have requested a transfer for an amount in excess of the remaining availability of the transaction
it: Avete richiesto uno storno per un importo eccedente la disponibilità residua della transazione

source: Invalid BANKTRANSACTIONID field
it: Campo BANKTRANSACTIONID non correttamente valorizzato

source: Empty BANKTRANSACTIONID and SHOPTRANSACTIONID fields
it: Campi BANKTRANSACTIONID e SHOPTRANSACTIONID non valorizzati

source: Transaction can not be deleted
it: Transazione non cancellabile

source: Transaction can’t be diverted
it: Transazione non stornabile

source: Transaction can’t be transferred
it: Transazione non movimentabile

source: Transaction not voidable
it: Transazione non annullabile

source: Wrong credit card check digit. Please check the number of the credit cart.
it: Carta di credito con Check-digit errato. Verificare il numero di carta inserito.

source: System error
it: Errore di sistema

source: Unrecognized vendor
it: Esercente non riconosciuto

source: Invalid format
it: Formato invalido

source: Not transferred
it: Non movimentata

source: Pin attempts exceeded
it: Tentativi PIN esauriti

source: Locked terminal
it: Terminale bloccato

source: Terminal forcibly closed
it: Terminale chiuso forzatamente

source: Transaction not allowed
it: Transazione non permessa

source: Transaction not authorized
it: Transazione non autorizzata

source: Service not available on 01/01/2002.
it: Servizio sospeso il 01/01/2002.

source: Authorization not granted
it: Autorizzazione non concessa

source: Flow correctly processed
it: Flusso elaborato correttamente

source: Header/footer record not found
it: Record di testa/coda non presente

source: Empty vendor code
it: Cod.esercente non valorizzato

source: Incongruent number of rows
it: Numero righe incongruente

source: Wrong file format
it: File con formato errato

source: Vendor not enabled to the function
it: Esercente non abilitato alla funzione

source: Unavailable function for VISA cards
it: Funzione non disponibile per carte VISA

source: Unavailable function
it: Funzione non disponibile

source: Payment aborted
it: Pagamento interrotto

source: Wrong credit card number for this operation
it: Numero carta di credito errato per questa operazione

source: Operation successfully acquired
it: Operazione acquisita correttamente

source: Authorization not found
it: Autorizzazione non trovata

source: Movement not found
it: Movimentazione non trovata

source: Movement amount greater that authorized amount
it: Imòporto movimento maggiore dell’importo autorizzato

source: Transfer amount greather than the balance
it: Importo storno maggiore del saldo

source: Operation not transferred
it: Operazione non movimentata

source: Flow waiting to be processed
it: Flusso in attesa di elaborazione

source: Unavailable function for MASTERCARD cards
it: Funzione non disponibile per carte MASTERCARD

source: Unavailable function for JBC cards
it: Funzione non disponibile per carte JCB

source: Unavailable function for MAESTRO cards
it: Funzione non disponibile per carte MAESTRO

source: Unsupported browser
it: Browser non supportato

source: Error during iFrame creation
it: Errore nella creazione dell’iFrame

source: Step with errors
it: Fase con errori

source: Step successful
it: Fase correttamente eseguita

source: Generic error
it: Errore generico

source: Unknown error (%s)
it: Errore sconosciuto (%s)

source: Italian
it: Italiano

source: English
it: Inglese

source: Spanish
it: Spagnolo

source: French
it: Francese

source: German
it: Tedesco
